music_app/app/models/user.rb

  def reset_session_token!
    self.update!(session_token: User.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "VKmhSrs0Aku3nTFzummgag"], ["updated_at", "2019-07-04 16:08:40.800580"], ["id", 1]]