music_app/app/views/albums/edit.html.erb

SELECT "bands".* FROM "bands"
---
    <select name="album[band_id]" id="bands">
    <% Band.all.each do |band| %>