music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "band_id", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asda"], ["band_id", 2], ["year", 1], ["live", true], ["created_at", "2019-07-04 18:42:26.930752"], ["updated_at", "2019-07-04 18:42:26.930752"]]
---
  def create
    # params[:album][:live] = Boolean.new.cast(params[:album][:live]) if ["true","false"].include?(params[:ablum][:live])
    @album = Album.new(album_params)
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "year" = $2, "live" = $3, "updated_at" = $4 WHERE "albums"."id" = $5  [["title", "Yung... Gravy's Comback"], ["year", 2016], ["live", true], ["updated_at", "2019-07-04 19:06:59.763938"], ["id", 1]]
---
  def update
    @album = Album.find(params[:id])
    if @album.update_attributes(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]
---
  def destroy
    @album = Album.find(params[:id])
    band_id = @album.band_id
    @album.destroy