music_app/app/views/tracks/new.html.erb

    <select name="track[album_id]" id="albums">
    <% Album.where(band_id: Album.find(params[:album_id]).band_id).each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]